//A stage is made up of object(s), and object(s) only.
//An object has one or more properties. Usually not only one.
//Descriptions of different properties will be given with examples.

//More will be added, but it does mot mean that it will be added to/supported by the game.

//Type: what the object is.
//Type "Rabbit": it is a rabbit, the charactor for player to control.
//Position: where the object is.
//Angle: where the object is facing. "0" means the object is facing the x axis' positive side. Values [0,360).
[
  {"Type": "Rabbit", "Position" :["100","200"], "Angle" :"0"},

  //Type "Carrot": what the rabbit want to get. Getting(let rabbit reach) all carrots will pass the stage.
  //Passable: describes whether if the rabbit can pass the object.
  //Lethal: describes whether if the rabbit will fall when stepping on the object.
  {"Type": "Carrot", "Passable": "true", "Lethal": "false", "Position": ["300", "150"]},

  //Type "Rotator": when stepped on, the rabbit will stop moving, rotate a given angle, then move again.
  //Rotation: Rotator-only property. Describes the angle the rabbit will turn when stepping on this Rotator.
  {"Type": "Rotator", "Passable": "true", "Lethal":"false", "Position": ["350", "160"], "Rotation": "90"}

  //Type "Teleporter": when stepped on, the rabbit will stop moving, teleported to a given position, then move again.
  //TeleportTo: Teleporter-only property. Describes the position the rabbit will be teleported to when stepping on this Teleporter.
  {"Type":"Teleporter", "Passable":"true", "Leathal":"false", "Position":["12","450"], "TeleportTo":["54","120"]}
  
  //Type "River": a part of a river, simply stops rabbit from moving.
  {"Type":"River", "Passable":"false", "Leathal":"false", "Position":["123","224"]}
  
  //Type "Key": collectable item, as same as Carrot. Taking it allows the rabbit to open a Gate.
  //Type "Gate": stops rabbit from moving, but not when the rabbit has the correct key.
  //KeySerial: used to judge whether a key can open a gate(or something).
  {"Type":"Key", "Passable":"true", "Leathal":"false", "Position":["456","789"], "KeySerial":"0"}
  {"Type":"Gate", "Passable":"false", "Leathal":"false", "Position":["991","438"], "KeySerial":"0"}
  
  //More Coming
]
